In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('../dataset/jobs.csv', sep=',')
df.head()

   id          jobs
0   1  ish lavozimi
1   2     polkovnik
2   3  podpolkovnik
3   4         mayor
4   5       kapitan

In [5]:
df['jobs'] = df['jobs'].str.lower()
df.head()

    id         jobs  Unnamed: 2
0  423       rahbar         NaN
1  422    kardiolog         NaN
2  421       jarrox         NaN
3  420  rentgenolog         NaN
4  419          uzi         NaN

In [6]:
df.sort_values(by='id', ascending=True, inplace=True)
df.head()

     id          jobs  Unnamed: 2
422   1  ish lavozimi         NaN
421   2     polkovnik         NaN
420   3  podpolkovnik         NaN
419   4         mayor         NaN
418   5       kapitan         NaN

In [7]:
df.drop(columns=['Unnamed: 2'], inplace=True)
df.head()

     id          jobs
422   1  ish lavozimi
421   2     polkovnik
420   3  podpolkovnik
419   4         mayor
418   5       kapitan

In [8]:
len(df)

423

In [3]:
df.to_csv('../dataset/jobs.csv', index=False)